Revit 2026 API

# FailureMessageAccessorGetNumberOfResolutions Method

---

Retrieves number of resolutions that can be used to resolve failure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetNumberOfResolutions()
```
```vb
Public Function GetNumberOfResolutions As Integer
```
```cpp
public:
int GetNumberOfResolutions()
```
```fsharp
member GetNumberOfResolutions : unit -> int
```

#### Return Value

Int32 Number of resolutions that can be used to resolve failure

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailureMessageAccessor has not been properly initialized. |

If number of resolutions is zero, the failure cannot be resolved. If severity of the failure is Warning, it can be deleted. Otherwise, the only option is to cancel current operation and roll back the transaction

#### Reference

FailureMessageAccessor Class

Autodesk.Revit.DB Namespace